import persian_fa from 'react-date-object/locales/persian_fa';

export const CustomPersianFa = {
  name: "persian_fa_custom",
  months: [
    ["فروردین", "فر"],
    ["اردیبهشت", "ار"],
    ["خرداد", "خر"],
    ["تیر", "تی"],
    ["مرداد", "مر"],
    ["شهریور", "شه"],
    ["مهر", "مه"],
    ["آبان", "آب"],
    ["آذر", "آذ"],
    ["دی", "دی"],
    ["بهمن", "به"],
    ["اسفند", "اس"],
  ],
  weekDays: [
    ["شنبه", "ش"],
    ["یکشنبه", "ی"],
    ["دوشنبه", "د"],
    ["سه‌شنبه", "س"],
    ["چهارشنبه", "چ"],
    ["پنج‌شنبه", "پ"],
    ["جمعه", "ج"],
  ],
  digits: ["۰", "۱", "۲", "۳", "۴", "۵", "۶", "۷", "۸", "۹"],
  meridiem: ["قبل از ظهر", "بعد از ظهر"],
};

export const customPersianLocale = {
  ...persian_fa,
  digits: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"], // اعداد انگلیسی
};
